### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.container_apps.module.payment_updater_ca_itn_01.azurerm_container_app.this has changed
  ~ resource "azurerm_container_app" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.App/containerApps/io-p-itn-com-paymentup-ca-01"
      ~ latest_revision_fqdn          = "io-p-itn-com-paymentup-ca-01--0000003.bluesand-bdc6dc22.italynorth.azurecontainerapps.io" -> "io-p-itn-com-paymentup-ca-01--0000005.bluesand-bdc6dc22.italynorth.azurecontainerapps.io"
        name                          = "io-p-itn-com-paymentup-ca-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_container_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "3.0.1"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (9 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.mysql.azurerm_key_vault_secret.reminder_mysql_db_server_url will be created
  + resource "azurerm_key_vault_secret" "reminder_mysql_db_server_url" {
      + content_type            = "text/plain"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-com-kv-01"
      + name                    = "mysql-url"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.mysql.azurerm_mysql_flexible_database.reminder will be created
  + resource "azurerm_mysql_flexible_database" "reminder" {
      + charset             = "utf8mb3"
      + collation           = "utf8mb3_unicode_ci"
      + id                  = (known after apply)
      + name                = "reminder"
      + resource_group_name = "io-p-itn-com-rg-01"
      + server_name         = "io-p-itn-com-mysql-01"
    }

  # module.mysql.azurerm_mysql_flexible_server.com will be created
  + resource "azurerm_mysql_flexible_server" "com" {
      + administrator_login           = (sensitive value)
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 7
      + delegated_subnet_id           = (known after apply)
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "italynorth"
      + name                          = "io-p-itn-com-mysql-01"
      + private_dns_zone_id           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.mysql.database.azure.com"
      + public_network_access         = (known after apply)
      + public_network_access_enabled = (known after apply)
      + replica_capacity              = (known after apply)
      + replication_role              = (known after apply)
      + resource_group_name           = "io-p-itn-com-rg-01"
      + sku_name                      = "B_Standard_B1ms"
      + tags                          = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + version                       = "8.0.21"
      + zone                          = "3"

      + storage (known after apply)
    }

  # module.mysql.azurerm_mysql_flexible_server_configuration.max_connections will be created
  + resource "azurerm_mysql_flexible_server_configuration" "max_connections" {
      + id                  = (known after apply)
      + name                = "max_connections"
      + resource_group_name = "io-p-itn-com-rg-01"
      + server_name         = "io-p-itn-com-mysql-01"
      + value               = "341"
    }

  # module.mysql.azurerm_subnet.com_mysql will be created
  + resource "azurerm_subnet" "com_mysql" {
      + address_prefixes                              = [
          + "10.0.155.16/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "io-p-itn-com-mysql-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "io-p-itn-common-rg-01"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "fs"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforMySQL/flexibleServers"
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>
